In [2]:
# conda install -c anaconda sqlalchemy
# conda install -c anaconda pymysql
# optional:
#     conda install -c conda-forge ipython-sql

In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

 ······

In [3]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'

#### Option 1: Use Pandas for SQL Queries

In [4]:
engine = create_engine(connection_string)

In [5]:
query = '''
select *
from trans
limit 100
'''

In [6]:
data = pd.read_sql_query(query, engine)

In [7]:
type(data)

pandas.core.frame.DataFrame

#### Option 2: Use SQL for notebooks (remember: conda install -c conda-forge ipython-sql)

In [8]:
%load_ext sql

In [9]:
%sql {connection_string}

'Connected: root@bank'

#### - SQL Cell Magic

In [10]:
%%sql
select *
from loan
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(5314, 1787, 930705, 96396, 12, 8033.0, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610.0, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118.0, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939.0, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579.0, 'A'),
 (6687, 8261, 930913, 87840, 24, 3660.0, 'A'),
 (7284, 11265, 930915, 52788, 12, 4399.0, 'A'),
 (6111, 5428, 930924, 174744, 24, 7281.0, 'B'),
 (7235, 10973, 931013, 154416, 48, 3217.0, 'A'),
 (5997, 4894, 931104, 117024, 24, 4876.0, 'A')]

In [11]:
L = 10

In [12]:
%%sql
select *
from loan
limit :L;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(5314, 1787, 930705, 96396, 12, 8033.0, 'B'),
 (5316, 1801, 930711, 165960, 36, 4610.0, 'A'),
 (6863, 9188, 930728, 127080, 60, 2118.0, 'A'),
 (5325, 1843, 930803, 105804, 36, 2939.0, 'A'),
 (7240, 11013, 930906, 274740, 60, 4579.0, 'A'),
 (6687, 8261, 930913, 87840, 24, 3660.0, 'A'),
 (7284, 11265, 930915, 52788, 12, 4399.0, 'A'),
 (6111, 5428, 930924, 174744, 24, 7281.0, 'B'),
 (7235, 10973, 931013, 154416, 48, 3217.0, 'A'),
 (5997, 4894, 931104, 117024, 24, 4876.0, 'A')]

#### - SQL Line Magic

In [14]:
data = %sql select * from loan limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

In [15]:
L = 10

In [16]:
data = %sql select * from loan limit :L;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

In [18]:
partial_query = 'limit 10'

In [22]:
data = %sql select * from loan {partial_query}

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

In [20]:
type(data)

sql.run.ResultSet

In [21]:
data = data.DataFrame()